def get_translation(user_language: str, key: str) -> str:
    """
    Возвращает перевод по ключу для выбранного языка пользователя.
    Если перевода нет, возвращает текст на английском языке или на языке по умолчанию.

    :param user_language: Язык пользователя ('ru', 'ua', и т.д.)
    :param key: Ключ для поиска перевода
    :return: Строка перевода
    """
    # Попытка найти перевод для выбранного языка
    translation = translations.get(user_language, {}).get(key)

    # Если перевод не найден, пытаемся вернуть перевод на языке по умолчанию (например, на русском)
    if translation is None:
        translation = translations.get("ru", {}).get(key, f"No translation for {key}")

    return translation


locales_btn = {
    "ukrainian": {
        "select_language_ua": "Українська",
        "select_language_ru": "Русский",
        "work_to_site": "Робота з сайтом",
        "send_message": "Розсилка всім користувачам (або тільки вам)",
        "info_to_user": "Інформація про користувача",
        "work_to_table": "Робота з таблицями",
        "analyze_message": "Аналіз повідомлення",
        "get_info_google": "Отримати інформацію з Google таблиці",
        "special_options": "Особливі можливості",
        "fill_form": "Заповнити форму"
    },
    "russian": {
        "select_language_ua": "Українська",
        "select_language_ru": "Русский",
        "work_to_site": "Работа с сайтом",
        "send_message": "Рассылка всем пользователям (или только вам)",
        "info_to_user": "Информация про пользователя",
        "work_to_table": "Работа с таблицами",
        "analyze_message": "Анализ сообщения",
        "get_info_google": "Получить информацию из Google таблицы",
        "special_options": "Особые возможности",
        "fill_form": "Заполнить форму"
    }
}

translations = {
    "ru": {
        "welcome_message": "Приветствуем вас в боте, который представляет часть из доступных функций телеграмм. Выберите язык:",
        "language_selected_ua": "Обрано <b>Українську</b> мову. \n\nНатисніть кнопку <b>Головне меню</b>, чтобы перейти до головного меню.\n\n",
        "language_selected_ru": "Выбран язык <b>Русский</b>.\n\nНажмите кнопку <b>Главное меню</b>, чтобы перейти в головное меню.",
        "time_await_prompt": "Отправьте мне время (в секундах 1-60), через которое мне отправить вам сообщение:",
        "time_await_completed": "Прошло <b>{time_await}</b> секунд. Ваше сообщение:",
        "incorrect_data": "Вы ввели некорректные данные, отправьте цифру от 1 до 60",
        "main_menu_prompt": "Главное меню",
        "work_to_site_prompt": "Нажмите на кнопку ниже, и заполните форму",
        "send_message_prompt": "Отправьте мне сообщение, которое вы хотите отправить. Бот может обрабатывать любые сообщения (файлы, фотографии, видео, геолокацию, контакты и т.д.).",
        "user_info": "Вся информация про вас, которая доступна мне:",
        "fill_form_button": "Заполнить форму",
        # Добавьте другие переводы по мере необходимости
    },
    "ua": {
        "welcome_message": "Вітаємо вас в боті, який представляє частину з доступних функцій телеграм. Оберіть мову:",
        "language_selected_ua": "Обрано <b>Українську</b> мову. \n\nНатисніть кнопку <b>Головне меню</b>, щоб перейти до головного меню.\n\n",
        "language_selected_ru": "Вибрано мову <b>Російська</b>.\n\nНатисніть кнопку <b>Головне меню</b>, щоб перейти в головне меню.",
        "time_await_prompt": "Надішліть мені час (у секундах від 1 до 60), через який мені відправити вам повідомлення:",
        "time_await_completed": "Пройшло <b>{time_await}</b> секунд. Ваше повідомлення:",
        "incorrect_data": "Ви ввели некоректні дані, надішліть цифру від 1 до 60",
        "main_menu_prompt": "Головне меню",
        "work_to_site_prompt": "Натисніть на кнопку нижче, та заповніть форму",
        "send_message_prompt": "Надішліть мені повідомлення, яке ви хочете відправити. Бот може обробляти будь-які повідомлення (файли, фотографії, відео, геолокацію, контакти тощо).",
        "user_info": "Вся інформація про вас, яка доступна мені:",
        "fill_form_button": "Заповнити форму",
        # Добавьте другие переводы по мере необходимости
    }
}
